; ModuleID = './UEFI_testcase.bc'
source_filename = "llvm-link"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct._NOTIFY_PROTOCOL_READY_PROTOCOL = type { i32 }
%struct.HEAP = type { [3 x %struct.CHUNK*], [10 x %struct.CHUNK*] }
%struct.CHUNK = type { %struct.CHUNK* }
%struct.HEAP_METADATA_T = type { [30 x %struct.Handle_Entry_T], i64 }
%struct.Handle_Entry_T = type { %struct.CHUNK*, i64, i64 }
%struct._HEAP_MANAGER_PROTOCOL = type { i64 (i64, i64*)*, i64 (i64, %struct.CHUNK**)*, i64 (i64)*, i64 (...)*, i64 (...)*, i64 (...)*, i64 (i64, %struct.CHUNK**)*, i64 (...)*, i64 (...)* }
%struct._CHAR_CONVERTER_PROTOCOL = type { i64 (i8*, i8*, %struct.ICONV_T**)*, i64 (%struct.ICONV_T*, i8*, i64, i8**, i64*)*, i64 (i8*, i64*, %struct._HEAP_MANAGER_PROTOCOL*)*, i64 (i8*, i64*, %struct._HEAP_MANAGER_PROTOCOL*)*, i64 (i8*, i64*, %struct._HEAP_MANAGER_PROTOCOL*)* }
%struct.ICONV_T = type { i8*, i8* }

!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!84 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !14, line: 1163, type: !76, isLocal: true, isDefinition: true)
!85 = !DIFile(filename: "Testcases/Sample2Tests/CharConverter/CharConverter.c", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "d2e7f8562ea900fd3b862d2fdaef4ac5")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "NOTIFY_PROTOCOL_READY_PROTOCOL", file: !75, line: 122, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NOTIFY_PROTOCOL_READY_PROTOCOL", file: !75, line: 120, size: 32, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ReadyFlags", scope: !87, file: !75, line: 121, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !57, line: 170, baseType: !7)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "BlockSizes", scope: !93, file: !123, line: 7, type: !157, isLocal: false, isDefinition: true)
!93 = distinct !DICompileUnit(language: DW_LANG_C99, file: !94, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !95, globals: !110, splitDebugInlining: false, nameTableKind: None)
!94 = !DIFile(filename: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases/Testcases/Sample2Tests/HeapManager/HeapManager.c", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases/Build/OvmfX64/NOOPT_CLANGPDB/X64/Testcases/Sample2Tests/HeapManager/HeapManager", checksumkind: CSK_MD5, checksum: "6c926d8fe363f8895e792556b2d0d8e9")
!95 = !{!54, !68, !65, !96, !103, !53, !108, !71}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHUNK_T", file: !98, line: 34, baseType: !99)
!98 = !DIFile(filename: "Testcases/Sample2Tests/HeapManager/HeapManager.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "e714afc4efaaf897241f252dc062e7a1")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHUNK", file: !98, line: 32, size: 64, elements: !100)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !99, file: !98, line: 33, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAGE_T", file: !98, line: 38, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PAGE", file: !98, line: 36, size: 64, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Self", scope: !105, file: !98, line: 37, baseType: !96, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !57, line: 196, baseType: !69)
!110 = !{!91, !111, !113, !115, !117, !119, !121, !128, !141}
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!112 = distinct !DIGlobalVariable(name: "B_080", scope: !93, file: !98, line: 27, type: !76, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!114 = distinct !DIGlobalVariable(name: "B_100", scope: !93, file: !98, line: 28, type: !76, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!116 = distinct !DIGlobalVariable(name: "B_200", scope: !93, file: !98, line: 29, type: !76, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!118 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesData", scope: !93, file: !6, line: 70, type: !76, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!120 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !93, file: !14, line: 1163, type: !76, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "mHeapManagerReady", scope: !93, file: !123, line: 3, type: !124, isLocal: false, isDefinition: true)
!123 = !DIFile(filename: "Testcases/Sample2Tests/HeapManager/HeapManager.c", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "6c926d8fe363f8895e792556b2d0d8e9")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "NOTIFY_PROTOCOL_READY_PROTOCOL", file: !98, line: 122, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NOTIFY_PROTOCOL_READY_PROTOCOL", file: !98, line: 120, size: 32, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ReadyFlags", scope: !125, file: !98, line: 121, baseType: !90, size: 32)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "Heap", scope: !93, file: !123, line: 5, type: !130, isLocal: false, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_T", file: !98, line: 55, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEAP", file: !98, line: 52, size: 832, elements: !132)
!132 = !{!133, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Pages", scope: !131, file: !98, line: 53, baseType: !134, size: 192)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 192, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 3)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "FreeList", scope: !131, file: !98, line: 54, baseType: !138, size: 640, offset: 192)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 640, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 10)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "HeapMd", scope: !93, file: !123, line: 6, type: !143, isLocal: false, isDefinition: true)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_METADATA_T", file: !98, line: 49, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEAP_METADATA_T", file: !98, line: 46, size: 5824, elements: !145)
!145 = !{!146, !156}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "HandleTable", scope: !144, file: !98, line: 47, baseType: !147, size: 5760)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 5760, elements: !154)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "Handle_Entry_T", file: !98, line: 44, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Handle_Entry_T", file: !98, line: 40, size: 192, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ChunkPtr", scope: !149, file: !98, line: 41, baseType: !96, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ChunkSize", scope: !149, file: !98, line: 42, baseType: !56, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "InUse", scope: !149, file: !98, line: 43, baseType: !65, size: 64, offset: 128)
!154 = !{!155}
!155 = !DISubrange(count: 30)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "FreeHandleTop", scope: !144, file: !98, line: 48, baseType: !65, size: 64, offset: 5760)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 192, elements: !135)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "mHeapManager", scope: !160, file: !213, line: 3, type: !246, isLocal: false, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !176, globals: !210, splitDebugInlining: false, nameTableKind: None)
!161 = !DIFile(filename: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases/Testcases/Sample2Tests/Sample2TestsDriver/Sample2TestsDriver.c", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases/Build/OvmfX64/NOOPT_CLANGPDB/X64/Testcases/Sample2Tests/Sample2TestsDriver/Sample2TestsDriver", checksumkind: CSK_MD5, checksum: "3adaf1c4a19765f62b2ca720d13894ba")
!162 = !{!163, !171, !5, !13, !20, !39, !44, !47}
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OP_TYPE", file: !164, line: 17, baseType: !7, size: 32, elements: !165)
!164 = !DIFile(filename: "Testcases/Sample2Tests/Sample2TestsDriver/Sample2TestsDriver.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "aaa522c4986706b69bb07c8847f73366")
!165 = !{!166, !167, !168, !169, !170}
!166 = !DIEnumerator(name: "CONVERT", value: 0)
!167 = !DIEnumerator(name: "FREE_LIST", value: 1)
!168 = !DIEnumerator(name: "DISPLAY_LIST", value: 2)
!169 = !DIEnumerator(name: "DISPLAY_METADATA", value: 3)
!170 = !DIEnumerator(name: "MSG", value: 4)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CONVERT_TYPE", file: !164, line: 25, baseType: !7, size: 32, elements: !172)
!172 = !{!173, !174, !175}
!173 = !DIEnumerator(name: "STANDARD", value: 0)
!174 = !DIEnumerator(name: "LIBXML2", value: 1)
!175 = !DIEnumerator(name: "PKEXEC", value: 2)
!176 = !{!68, !54, !177, !53, !186, !71, !65}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR_CONVERTER_DATA", file: !164, line: 37, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHAR_CONVERTER_DATA", file: !164, line: 34, size: 4160, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !179, file: !164, line: 35, baseType: !65, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !179, file: !164, line: 36, baseType: !183, size: 4096, offset: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 4096, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 512)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "SAMPLE2_TESTS_DRIVER_COMM_BUFFER", file: !164, line: 44, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SAMPLE2_TESTS_DRIVER_COMM_BUFFER", file: !164, line: 39, size: 8384, elements: !189)
!189 = !{!190, !204, !205, !206}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Sample2Guid", scope: !188, file: !164, line: 40, baseType: !191, size: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !192, line: 25, baseType: !193)
!192 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "652b6036ee3f46705189b44807c85960")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !55, line: 218, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !55, line: 213, size: 128, elements: !195)
!195 = !{!196, !197, !199, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !194, file: !55, line: 214, baseType: !90, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !194, file: !55, line: 215, baseType: !198, size: 16, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !57, line: 178, baseType: !61)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !194, file: !55, line: 216, baseType: !198, size: 16, offset: 48)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !194, file: !55, line: 217, baseType: !201, size: 64, offset: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Operation", scope: !188, file: !164, line: 41, baseType: !163, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Conversion", scope: !188, file: !164, line: 42, baseType: !171, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !188, file: !164, line: 43, baseType: !207, size: 8192, offset: 192)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 8192, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1024)
!210 = !{!158, !211, !301, !303}
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "mCharConverter", scope: !160, file: !213, line: 4, type: !214, isLocal: false, isDefinition: true)
!213 = !DIFile(filename: "Testcases/Sample2Tests/Sample2TestsDriver/Sample2TestsDriver.c", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "3adaf1c4a19765f62b2ca720d13894ba")
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR_CONVERTER_PROTOCOL", file: !216, line: 83, baseType: !217)
!216 = !DIFile(filename: "Testcases/Sample2Tests/Sample2TestsDriver/../CharConverter/CharConverter.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "ac05300bbbb33b9bef78614a50737cb1")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHAR_CONVERTER_PROTOCOL", file: !216, line: 77, size: 320, elements: !218)
!218 = !{!219, !234, !241, !297, !299}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "IconvOpen", scope: !217, file: !216, line: 78, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR_CONVERTER_ICONV_OPEN", file: !216, line: 37, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !225, !225, !227}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !192, line: 29, baseType: !54)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ICONV_T", file: !216, line: 25, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ICONV_T", file: !216, line: 22, size: 128, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "FromEncoding", scope: !230, file: !216, line: 23, baseType: !70, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ToEncoding", scope: !230, file: !216, line: 24, baseType: !70, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Iconv", scope: !217, file: !216, line: 79, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR_CONVERTER_ICONV", file: !216, line: 45, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!224, !228, !70, !65, !239, !240}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "StandardConvert", scope: !217, file: !216, line: 80, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR_CONVERTER_STANDARD_CONVERT", file: !216, line: 55, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!224, !70, !240, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_PROTOCOL", file: !248, line: 118, baseType: !249)
!248 = !DIFile(filename: "Testcases/Sample2Tests/Sample2TestsDriver/../CharConverter/../HeapManager/HeapManager.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "e714afc4efaaf897241f252dc062e7a1")
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_HEAP_MANAGER_PROTOCOL", file: !248, line: 108, size: 576, elements: !250)
!250 = !{!251, !256, !268, !273, !278, !280, !282, !293, !295}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "GetBlockSize", scope: !249, file: !248, line: 109, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_GET_BLOCK_SIZE", file: !248, line: 63, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!224, !56, !240}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "AllocateChunk", scope: !249, file: !248, line: 110, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_ALLOCATE_CHUNK", file: !248, line: 70, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!224, !56, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHUNK_T", file: !248, line: 34, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHUNK", file: !248, line: 32, size: 64, elements: !265)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !264, file: !248, line: 33, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "FreeChunk", scope: !249, file: !248, line: 111, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_FREE_CHUNK", file: !248, line: 77, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!224, !65}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "FreeAllocList", scope: !249, file: !248, line: 112, baseType: !274, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_FREE_ALLOC_LIST", file: !248, line: 83, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!224, null}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "DisplayFreeList", scope: !249, file: !248, line: 113, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_DISPLAY_FREE_LIST", file: !248, line: 87, baseType: !275)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "DisplayHeapMetadata", scope: !249, file: !248, line: 114, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_DISPLAY_HEAP_METADATA", file: !248, line: 91, baseType: !275)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "InitializePage", scope: !249, file: !248, line: 115, baseType: !283, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_INITIALIZE_PAGE", file: !248, line: 95, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!224, !56, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAGE_T", file: !248, line: 38, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PAGE", file: !248, line: 36, size: 64, elements: !291)
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Self", scope: !290, file: !248, line: 37, baseType: !262, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "InitializeHeapMetadata", scope: !249, file: !248, line: 116, baseType: !294, size: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_INITIALIZE_HEAP_METADATA", file: !248, line: 102, baseType: !275)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "InitializeHeap", scope: !249, file: !248, line: 117, baseType: !296, size: 64, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_INITIALIZE_HEAP", file: !248, line: 106, baseType: !275)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Libxml2Convert", scope: !217, file: !216, line: 81, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR_CONVERTER_LIBXML2_CONVERT", file: !216, line: 63, baseType: !243)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "PkexecConvert", scope: !217, file: !216, line: 82, baseType: !300, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR_CONVERTER_PKEXEC_CONVERT", file: !216, line: 71, baseType: !243)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "w_msg", scope: !160, file: !213, line: 7, type: !62, isLocal: false, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "funcptr", scope: !160, file: !213, line: 8, type: !305, isLocal: false, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null, null}
!308 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!309 = !{i32 2, !"CodeView", i32 1}
!310 = !{i32 2, !"Debug Info Version", i32 3}
!311 = !{i32 1, !"wchar_size", i32 2}
!312 = !{i32 7, !"PIC Level", i32 2}
!313 = !{i32 1, !"Code Model", i32 1}
!314 = !{i32 7, !"uwtable", i32 1}
!315 = !{i32 1, !"ThinLTO", i32 0}
!316 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!317 = distinct !DISubprogram(name: "IconvOpen", scope: !85, file: !85, line: 9, type: !318, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !328)
!318 = !DISubroutineType(types: !319)
!319 = !{!224, !225, !225, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ICONV_T", file: !323, line: 25, baseType: !324)
!323 = !DIFile(filename: "Testcases/Sample2Tests/CharConverter/CharConverter.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "ac05300bbbb33b9bef78614a50737cb1")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ICONV_T", file: !323, line: 22, size: 128, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "FromEncoding", scope: !324, file: !323, line: 23, baseType: !70, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ToEncoding", scope: !324, file: !323, line: 24, baseType: !70, size: 64, offset: 64)
!328 = !{}
!329 = !DILocalVariable(name: "ToEncoding", arg: 1, scope: !317, file: !85, line: 10, type: !225)
!330 = !DILocation(line: 10, scope: !317)
!331 = !DILocalVariable(name: "FromEncoding", arg: 2, scope: !317, file: !85, line: 11, type: !225)
!332 = !DILocation(line: 11, scope: !317)
!333 = !DILocalVariable(name: "CharDesc", arg: 3, scope: !317, file: !85, line: 12, type: !320)
!334 = !DILocation(line: 12, scope: !317)
!335 = !DILocation(line: 15, scope: !317)
!336 = !DILocation(line: 16, scope: !317)
!337 = !DILocation(line: 17, scope: !338)
!338 = distinct !DILexicalBlock(scope: !339, file: !85, line: 16)
!339 = distinct !DILexicalBlock(scope: !317, file: !85, line: 16)
!340 = !DILocation(line: 21, scope: !317)
!341 = !DILocation(line: 22, scope: !317)
!342 = !DILocation(line: 23, scope: !343)
!343 = distinct !DILexicalBlock(scope: !344, file: !85, line: 22)
!344 = distinct !DILexicalBlock(scope: !317, file: !85, line: 22)
!345 = !DILocation(line: 24, scope: !343)
!346 = !DILocation(line: 25, scope: !343)
!347 = !DILocation(line: 27, scope: !317)
!348 = !DILocation(line: 29, scope: !317)
!349 = !DILocation(line: 30, scope: !317)
!350 = !DILocation(line: 31, scope: !351)
!351 = distinct !DILexicalBlock(scope: !352, file: !85, line: 30)
!352 = distinct !DILexicalBlock(scope: !317, file: !85, line: 30)
!353 = !DILocation(line: 32, scope: !351)
!354 = !DILocation(line: 33, scope: !351)
!355 = !DILocation(line: 34, scope: !351)
!356 = !DILocation(line: 36, scope: !317)
!357 = !DILocation(line: 38, scope: !317)
!358 = !DILocation(line: 39, scope: !317)
!359 = distinct !DISubprogram(name: "Iconv", scope: !85, file: !85, line: 44, type: !360, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !328)
!360 = !DISubroutineType(types: !361)
!361 = !{!224, !321, !70, !65, !239, !240}
!362 = !DILocalVariable(name: "CharDesc", arg: 1, scope: !359, file: !85, line: 45, type: !321)
!363 = !DILocation(line: 45, scope: !359)
!364 = !DILocalVariable(name: "InputBuffer", arg: 2, scope: !359, file: !85, line: 46, type: !70)
!365 = !DILocation(line: 46, scope: !359)
!366 = !DILocalVariable(name: "InputSize", arg: 3, scope: !359, file: !85, line: 47, type: !65)
!367 = !DILocation(line: 47, scope: !359)
!368 = !DILocalVariable(name: "OutputBuffer", arg: 4, scope: !359, file: !85, line: 48, type: !239)
!369 = !DILocation(line: 48, scope: !359)
!370 = !DILocalVariable(name: "OutputSize", arg: 5, scope: !359, file: !85, line: 49, type: !240)
!371 = !DILocation(line: 49, scope: !359)
!372 = !DILocation(line: 51, scope: !359)
!373 = !DILocation(line: 54, scope: !374)
!374 = distinct !DILexicalBlock(scope: !375, file: !85, line: 52)
!375 = distinct !DILexicalBlock(scope: !359, file: !85, line: 51)
!376 = !DILocation(line: 55, scope: !377)
!377 = distinct !DILexicalBlock(scope: !378, file: !85, line: 54)
!378 = distinct !DILexicalBlock(scope: !374, file: !85, line: 54)
!379 = !DILocalVariable(name: "i", scope: !380, file: !85, line: 58, type: !56)
!380 = distinct !DILexicalBlock(scope: !374, file: !85, line: 58)
!381 = !DILocation(line: 58, scope: !380)
!382 = !DILocation(line: 59, scope: !383)
!383 = distinct !DILexicalBlock(scope: !384, file: !85, line: 58)
!384 = distinct !DILexicalBlock(scope: !380, file: !85, line: 58)
!385 = !DILocation(line: 60, scope: !383)
!386 = !DILocation(line: 61, scope: !383)
!387 = !DILocation(line: 58, scope: !384)
!388 = distinct !{!388, !381, !389, !390}
!389 = !DILocation(line: 61, scope: !380)
!390 = !{!"llvm.loop.mustprogress"}
!391 = !DILocation(line: 63, scope: !374)
!392 = !DILocation(line: 64, scope: !374)
!393 = !DILocation(line: 66, scope: !375)
!394 = !DILocation(line: 69, scope: !395)
!395 = distinct !DILexicalBlock(scope: !396, file: !85, line: 67)
!396 = distinct !DILexicalBlock(scope: !375, file: !85, line: 66)
!397 = !DILocation(line: 70, scope: !398)
!398 = distinct !DILexicalBlock(scope: !399, file: !85, line: 69)
!399 = distinct !DILexicalBlock(scope: !395, file: !85, line: 69)
!400 = !DILocalVariable(name: "i", scope: !401, file: !85, line: 73, type: !56)
!401 = distinct !DILexicalBlock(scope: !395, file: !85, line: 73)
!402 = !DILocation(line: 73, scope: !401)
!403 = !DILocalVariable(name: "utf16_str", scope: !404, file: !85, line: 74, type: !62)
!404 = distinct !DILexicalBlock(scope: !405, file: !85, line: 73)
!405 = distinct !DILexicalBlock(scope: !401, file: !85, line: 73)
!406 = !DILocation(line: 74, scope: !404)
!407 = !DILocation(line: 75, scope: !404)
!408 = !DILocation(line: 76, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !85, line: 75)
!410 = distinct !DILexicalBlock(scope: !404, file: !85, line: 75)
!411 = !DILocation(line: 77, scope: !409)
!412 = !DILocation(line: 78, scope: !413)
!413 = distinct !DILexicalBlock(scope: !410, file: !85, line: 77)
!414 = !DILocation(line: 79, scope: !413)
!415 = !DILocation(line: 80, scope: !404)
!416 = !DILocation(line: 81, scope: !404)
!417 = !DILocation(line: 73, scope: !405)
!418 = distinct !{!418, !402, !419, !390}
!419 = !DILocation(line: 81, scope: !401)
!420 = !DILocation(line: 83, scope: !395)
!421 = !DILocation(line: 84, scope: !395)
!422 = !DILocation(line: 86, scope: !396)
!423 = !DILocation(line: 89, scope: !424)
!424 = distinct !DILexicalBlock(scope: !425, file: !85, line: 87)
!425 = distinct !DILexicalBlock(scope: !396, file: !85, line: 86)
!426 = !DILocation(line: 90, scope: !427)
!427 = distinct !DILexicalBlock(scope: !428, file: !85, line: 89)
!428 = distinct !DILexicalBlock(scope: !424, file: !85, line: 89)
!429 = !DILocalVariable(name: "i", scope: !430, file: !85, line: 92, type: !56)
!430 = distinct !DILexicalBlock(scope: !424, file: !85, line: 92)
!431 = !DILocation(line: 92, scope: !430)
!432 = !DILocation(line: 93, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !85, line: 92)
!434 = distinct !DILexicalBlock(scope: !430, file: !85, line: 92)
!435 = !DILocation(line: 94, scope: !433)
!436 = !DILocation(line: 95, scope: !437)
!437 = distinct !DILexicalBlock(scope: !438, file: !85, line: 94)
!438 = distinct !DILexicalBlock(scope: !433, file: !85, line: 94)
!439 = !DILocation(line: 96, scope: !437)
!440 = !DILocation(line: 98, scope: !441)
!441 = distinct !DILexicalBlock(scope: !438, file: !85, line: 96)
!442 = !DILocation(line: 100, scope: !443)
!443 = distinct !DILexicalBlock(scope: !444, file: !85, line: 99)
!444 = distinct !DILexicalBlock(scope: !441, file: !85, line: 98)
!445 = !DILocation(line: 101, scope: !443)
!446 = !DILocation(line: 102, scope: !443)
!447 = !DILocation(line: 103, scope: !443)
!448 = !DILocation(line: 104, scope: !443)
!449 = !DILocation(line: 105, scope: !443)
!450 = !DILocation(line: 106, scope: !443)
!451 = !DILocation(line: 107, scope: !443)
!452 = !DILocation(line: 111, scope: !453)
!453 = distinct !DILexicalBlock(scope: !444, file: !85, line: 110)
!454 = !DILocation(line: 112, scope: !453)
!455 = !DILocation(line: 113, scope: !441)
!456 = !DILocation(line: 114, scope: !433)
!457 = !DILocation(line: 92, scope: !434)
!458 = distinct !{!458, !431, !459, !390}
!459 = !DILocation(line: 114, scope: !430)
!460 = !DILocation(line: 116, scope: !424)
!461 = !DILocation(line: 117, scope: !424)
!462 = !DILocation(line: 118, scope: !424)
!463 = !DILocation(line: 120, scope: !425)
!464 = !DILocation(line: 123, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !85, line: 121)
!466 = distinct !DILexicalBlock(scope: !425, file: !85, line: 120)
!467 = !DILocation(line: 124, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !85, line: 123)
!469 = distinct !DILexicalBlock(scope: !465, file: !85, line: 123)
!470 = !DILocalVariable(name: "OutIndex", scope: !465, file: !85, line: 127, type: !56)
!471 = !DILocation(line: 127, scope: !465)
!472 = !DILocalVariable(name: "i", scope: !473, file: !85, line: 128, type: !56)
!473 = distinct !DILexicalBlock(scope: !465, file: !85, line: 128)
!474 = !DILocation(line: 128, scope: !473)
!475 = !DILocalVariable(name: "Char", scope: !476, file: !85, line: 129, type: !109)
!476 = distinct !DILexicalBlock(scope: !477, file: !85, line: 128)
!477 = distinct !DILexicalBlock(scope: !473, file: !85, line: 128)
!478 = !DILocation(line: 129, scope: !476)
!479 = !DILocation(line: 131, scope: !476)
!480 = !DILocation(line: 132, scope: !481)
!481 = distinct !DILexicalBlock(scope: !482, file: !85, line: 131)
!482 = distinct !DILexicalBlock(scope: !476, file: !85, line: 131)
!483 = !DILocation(line: 133, scope: !481)
!484 = !DILocation(line: 134, scope: !481)
!485 = !DILocation(line: 135, scope: !482)
!486 = !DILocalVariable(name: "Char2", scope: !487, file: !85, line: 136, type: !109)
!487 = distinct !DILexicalBlock(scope: !488, file: !85, line: 135)
!488 = distinct !DILexicalBlock(scope: !482, file: !85, line: 135)
!489 = !DILocation(line: 136, scope: !487)
!490 = !DILocation(line: 138, scope: !487)
!491 = !DILocalVariable(name: "UnicodeChar", scope: !492, file: !85, line: 139, type: !198)
!492 = distinct !DILexicalBlock(scope: !493, file: !85, line: 138)
!493 = distinct !DILexicalBlock(scope: !487, file: !85, line: 138)
!494 = !DILocation(line: 139, scope: !492)
!495 = !DILocation(line: 141, scope: !492)
!496 = !DILocation(line: 142, scope: !497)
!497 = distinct !DILexicalBlock(scope: !498, file: !85, line: 141)
!498 = distinct !DILexicalBlock(scope: !492, file: !85, line: 141)
!499 = !DILocation(line: 143, scope: !497)
!500 = !DILocation(line: 146, scope: !501)
!501 = distinct !DILexicalBlock(scope: !498, file: !85, line: 144)
!502 = !DILocation(line: 147, scope: !501)
!503 = !DILocation(line: 148, scope: !501)
!504 = !DILocation(line: 149, scope: !501)
!505 = !DILocation(line: 150, scope: !501)
!506 = !DILocation(line: 152, scope: !492)
!507 = !DILocation(line: 153, scope: !492)
!508 = !DILocation(line: 156, scope: !509)
!509 = distinct !DILexicalBlock(scope: !493, file: !85, line: 154)
!510 = !DILocation(line: 157, scope: !509)
!511 = !DILocation(line: 158, scope: !509)
!512 = !DILocation(line: 159, scope: !487)
!513 = !DILocation(line: 160, scope: !488)
!514 = !DILocalVariable(name: "Char2", scope: !515, file: !85, line: 162, type: !109)
!515 = distinct !DILexicalBlock(scope: !516, file: !85, line: 160)
!516 = distinct !DILexicalBlock(scope: !488, file: !85, line: 160)
!517 = !DILocation(line: 162, scope: !515)
!518 = !DILocalVariable(name: "Char3", scope: !515, file: !85, line: 163, type: !109)
!519 = !DILocation(line: 163, scope: !515)
!520 = !DILocation(line: 165, scope: !515)
!521 = !DILocalVariable(name: "UnicodeChar", scope: !522, file: !85, line: 166, type: !198)
!522 = distinct !DILexicalBlock(scope: !523, file: !85, line: 165)
!523 = distinct !DILexicalBlock(scope: !515, file: !85, line: 165)
!524 = !DILocation(line: 166, scope: !522)
!525 = !DILocation(line: 170, scope: !522)
!526 = !DILocation(line: 172, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !85, line: 170)
!528 = distinct !DILexicalBlock(scope: !522, file: !85, line: 170)
!529 = !DILocation(line: 173, scope: !527)
!530 = !DILocation(line: 174, scope: !522)
!531 = !DILocation(line: 175, scope: !522)
!532 = !DILocation(line: 177, scope: !533)
!533 = distinct !DILexicalBlock(scope: !523, file: !85, line: 176)
!534 = !DILocation(line: 178, scope: !533)
!535 = !DILocation(line: 179, scope: !533)
!536 = !DILocation(line: 180, scope: !515)
!537 = !DILocation(line: 182, scope: !538)
!538 = distinct !DILexicalBlock(scope: !516, file: !85, line: 181)
!539 = !DILocation(line: 183, scope: !538)
!540 = !DILocation(line: 184, scope: !538)
!541 = !DILocation(line: 160, scope: !516)
!542 = !DILocation(line: 135, scope: !488)
!543 = !DILocation(line: 128, scope: !477)
!544 = distinct !{!544, !474, !545, !390}
!545 = !DILocation(line: 185, scope: !473)
!546 = !DILocation(line: 187, scope: !465)
!547 = !DILocation(line: 199, scope: !465)
!548 = !DILocation(line: 121, scope: !466)
!549 = !DILocation(line: 87, scope: !425)
!550 = !DILocation(line: 67, scope: !396)
!551 = !DILocation(line: 203, scope: !359)
!552 = !DILocation(line: 204, scope: !359)
!553 = distinct !DISubprogram(name: "StandardConvert", scope: !85, file: !85, line: 208, type: !554, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !328)
!554 = !DISubroutineType(types: !555)
!555 = !{!224, !70, !240, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_PROTOCOL", file: !75, line: 118, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_HEAP_MANAGER_PROTOCOL", file: !75, line: 108, size: 576, elements: !559)
!559 = !{!560, !562, !574, !576, !578, !580, !582, !593, !595}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "GetBlockSize", scope: !558, file: !75, line: 109, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_GET_BLOCK_SIZE", file: !75, line: 63, baseType: !253)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "AllocateChunk", scope: !558, file: !75, line: 110, baseType: !563, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_ALLOCATE_CHUNK", file: !75, line: 70, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!224, !56, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHUNK_T", file: !75, line: 34, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHUNK", file: !75, line: 32, size: 64, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !570, file: !75, line: 33, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "FreeChunk", scope: !558, file: !75, line: 111, baseType: !575, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_FREE_CHUNK", file: !75, line: 77, baseType: !270)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "FreeAllocList", scope: !558, file: !75, line: 112, baseType: !577, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_FREE_ALLOC_LIST", file: !75, line: 83, baseType: !275)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "DisplayFreeList", scope: !558, file: !75, line: 113, baseType: !579, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_DISPLAY_FREE_LIST", file: !75, line: 87, baseType: !275)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "DisplayHeapMetadata", scope: !558, file: !75, line: 114, baseType: !581, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_DISPLAY_HEAP_METADATA", file: !75, line: 91, baseType: !275)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "InitializePage", scope: !558, file: !75, line: 115, baseType: !583, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_INITIALIZE_PAGE", file: !75, line: 95, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!224, !56, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PAGE_T", file: !75, line: 38, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PAGE", file: !75, line: 36, size: 64, elements: !591)
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Self", scope: !590, file: !75, line: 37, baseType: !568, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "InitializeHeapMetadata", scope: !558, file: !75, line: 116, baseType: !594, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_INITIALIZE_HEAP_METADATA", file: !75, line: 102, baseType: !275)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "InitializeHeap", scope: !558, file: !75, line: 117, baseType: !596, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEAP_MANAGER_INITIALIZE_HEAP", file: !75, line: 106, baseType: !275)
!597 = !DILocalVariable(name: "Input", arg: 1, scope: !553, file: !85, line: 209, type: !70)
!598 = !DILocation(line: 209, scope: !553)
!599 = !DILocalVariable(name: "Size", arg: 2, scope: !553, file: !85, line: 210, type: !240)
!600 = !DILocation(line: 210, scope: !553)
!601 = !DILocalVariable(name: "HeapManagerProtocol", arg: 3, scope: !553, file: !85, line: 211, type: !556)
!602 = !DILocation(line: 211, scope: !553)
!603 = !DILocalVariable(name: "cd", scope: !553, file: !85, line: 213, type: !321)
!604 = !DILocation(line: 213, scope: !553)
!605 = !DILocalVariable(name: "Status", scope: !553, file: !85, line: 214, type: !224)
!606 = !DILocation(line: 214, scope: !553)
!607 = !DILocation(line: 215, scope: !553)
!608 = !DILocation(line: 217, scope: !609)
!609 = distinct !DILexicalBlock(scope: !610, file: !85, line: 216)
!610 = distinct !DILexicalBlock(scope: !553, file: !85, line: 215)
!611 = !DILocation(line: 217, scope: !612)
!612 = distinct !DILexicalBlock(scope: !609, file: !85, line: 217)
!613 = !DILocation(line: 217, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !85, line: 217)
!615 = distinct !DILexicalBlock(scope: !612, file: !85, line: 217)
!616 = !DILocation(line: 217, scope: !617)
!617 = distinct !DILexicalBlock(scope: !614, file: !85, line: 217)
!618 = !DILocation(line: 217, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !85, line: 217)
!620 = distinct !DILexicalBlock(scope: !617, file: !85, line: 217)
!621 = !DILocation(line: 218, scope: !609)
!622 = !DILocalVariable(name: "Output", scope: !553, file: !85, line: 220, type: !568)
!623 = !DILocation(line: 220, scope: !553)
!624 = !DILocation(line: 222, scope: !553)
!625 = !DILocation(line: 223, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !85, line: 222)
!627 = distinct !DILexicalBlock(scope: !553, file: !85, line: 222)
!628 = !DILocation(line: 224, scope: !626)
!629 = !DILocation(line: 225, scope: !627)
!630 = !DILocation(line: 226, scope: !631)
!631 = distinct !DILexicalBlock(scope: !632, file: !85, line: 225)
!632 = distinct !DILexicalBlock(scope: !627, file: !85, line: 225)
!633 = !DILocation(line: 227, scope: !631)
!634 = !DILocation(line: 228, scope: !632)
!635 = !DILocation(line: 229, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !85, line: 228)
!637 = distinct !DILexicalBlock(scope: !632, file: !85, line: 228)
!638 = !DILocation(line: 230, scope: !636)
!639 = !DILocation(line: 232, scope: !640)
!640 = distinct !DILexicalBlock(scope: !637, file: !85, line: 231)
!641 = !DILocation(line: 232, scope: !642)
!642 = distinct !DILexicalBlock(scope: !640, file: !85, line: 232)
!643 = !DILocation(line: 232, scope: !644)
!644 = distinct !DILexicalBlock(scope: !645, file: !85, line: 232)
!645 = distinct !DILexicalBlock(scope: !642, file: !85, line: 232)
!646 = !DILocation(line: 232, scope: !647)
!647 = distinct !DILexicalBlock(scope: !644, file: !85, line: 232)
!648 = !DILocation(line: 232, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !85, line: 232)
!650 = distinct !DILexicalBlock(scope: !647, file: !85, line: 232)
!651 = !DILocation(line: 233, scope: !640)
!652 = !DILocation(line: 228, scope: !637)
!653 = !DILocation(line: 225, scope: !632)
!654 = !DILocalVariable(name: "OutputSize", scope: !553, file: !85, line: 236, type: !65)
!655 = !DILocation(line: 236, scope: !553)
!656 = !DILocalVariable(name: "InputPtr", scope: !553, file: !85, line: 237, type: !70)
!657 = !DILocation(line: 237, scope: !553)
!658 = !DILocalVariable(name: "OutputPtr", scope: !553, file: !85, line: 238, type: !70)
!659 = !DILocation(line: 238, scope: !553)
!660 = !DILocation(line: 239, scope: !553)
!661 = !DILocation(line: 240, scope: !553)
!662 = !DILocation(line: 241, scope: !553)
!663 = !DILocation(line: 242, scope: !553)
!664 = !DILocation(line: 243, scope: !665)
!665 = distinct !DILexicalBlock(scope: !553, file: !85, line: 242)
!666 = !DILocation(line: 245, scope: !553)
!667 = !DILocation(line: 246, scope: !553)
!668 = distinct !DISubprogram(name: "Libxml2Convert", scope: !85, file: !85, line: 250, type: !554, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !328)
!669 = !DILocalVariable(name: "Input", arg: 1, scope: !668, file: !85, line: 251, type: !70)
!670 = !DILocation(line: 251, scope: !668)
!671 = !DILocalVariable(name: "Size", arg: 2, scope: !668, file: !85, line: 252, type: !240)
!672 = !DILocation(line: 252, scope: !668)
!673 = !DILocalVariable(name: "HeapManagerProtocol", arg: 3, scope: !668, file: !85, line: 253, type: !556)
!674 = !DILocation(line: 253, scope: !668)
!675 = !DILocalVariable(name: "cd", scope: !668, file: !85, line: 255, type: !321)
!676 = !DILocation(line: 255, scope: !668)
!677 = !DILocalVariable(name: "Status", scope: !668, file: !85, line: 256, type: !224)
!678 = !DILocation(line: 256, scope: !668)
!679 = !DILocation(line: 257, scope: !668)
!680 = !DILocation(line: 259, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !85, line: 258)
!682 = distinct !DILexicalBlock(scope: !668, file: !85, line: 257)
!683 = !DILocation(line: 259, scope: !684)
!684 = distinct !DILexicalBlock(scope: !681, file: !85, line: 259)
!685 = !DILocation(line: 259, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !85, line: 259)
!687 = distinct !DILexicalBlock(scope: !684, file: !85, line: 259)
!688 = !DILocation(line: 259, scope: !689)
!689 = distinct !DILexicalBlock(scope: !686, file: !85, line: 259)
!690 = !DILocation(line: 259, scope: !691)
!691 = distinct !DILexicalBlock(scope: !692, file: !85, line: 259)
!692 = distinct !DILexicalBlock(scope: !689, file: !85, line: 259)
!693 = !DILocation(line: 260, scope: !681)
!694 = !DILocalVariable(name: "Output", scope: !668, file: !85, line: 262, type: !568)
!695 = !DILocation(line: 262, scope: !668)
!696 = !DILocation(line: 264, scope: !668)
!697 = !DILocation(line: 265, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !85, line: 264)
!699 = distinct !DILexicalBlock(scope: !668, file: !85, line: 264)
!700 = !DILocation(line: 266, scope: !698)
!701 = !DILocation(line: 267, scope: !699)
!702 = !DILocation(line: 268, scope: !703)
!703 = distinct !DILexicalBlock(scope: !704, file: !85, line: 267)
!704 = distinct !DILexicalBlock(scope: !699, file: !85, line: 267)
!705 = !DILocation(line: 269, scope: !703)
!706 = !DILocation(line: 270, scope: !704)
!707 = !DILocation(line: 271, scope: !708)
!708 = distinct !DILexicalBlock(scope: !709, file: !85, line: 270)
!709 = distinct !DILexicalBlock(scope: !704, file: !85, line: 270)
!710 = !DILocation(line: 272, scope: !708)
!711 = !DILocation(line: 274, scope: !712)
!712 = distinct !DILexicalBlock(scope: !709, file: !85, line: 273)
!713 = !DILocation(line: 274, scope: !714)
!714 = distinct !DILexicalBlock(scope: !712, file: !85, line: 274)
!715 = !DILocation(line: 274, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !85, line: 274)
!717 = distinct !DILexicalBlock(scope: !714, file: !85, line: 274)
!718 = !DILocation(line: 274, scope: !719)
!719 = distinct !DILexicalBlock(scope: !716, file: !85, line: 274)
!720 = !DILocation(line: 274, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !85, line: 274)
!722 = distinct !DILexicalBlock(scope: !719, file: !85, line: 274)
!723 = !DILocation(line: 275, scope: !712)
!724 = !DILocation(line: 270, scope: !709)
!725 = !DILocation(line: 267, scope: !704)
!726 = !DILocation(line: 277, scope: !668)
!727 = !DILocation(line: 278, scope: !728)
!728 = distinct !DILexicalBlock(scope: !668, file: !85, line: 277)
!729 = !DILocalVariable(name: "OutputSize", scope: !668, file: !85, line: 279, type: !65)
!730 = !DILocation(line: 279, scope: !668)
!731 = !DILocalVariable(name: "InputPtr", scope: !668, file: !85, line: 280, type: !70)
!732 = !DILocation(line: 280, scope: !668)
!733 = !DILocalVariable(name: "OutputPtr", scope: !668, file: !85, line: 281, type: !70)
!734 = !DILocation(line: 281, scope: !668)
!735 = !DILocation(line: 282, scope: !668)
!736 = !DILocation(line: 283, scope: !668)
!737 = !DILocation(line: 284, scope: !668)
!738 = !DILocation(line: 285, scope: !668)
!739 = !DILocation(line: 286, scope: !740)
!740 = distinct !DILexicalBlock(scope: !668, file: !85, line: 285)
!741 = !DILocation(line: 288, scope: !668)
!742 = !DILocation(line: 289, scope: !668)
!743 = distinct !DISubprogram(name: "PkexecConvert", scope: !85, file: !85, line: 293, type: !554, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !328)
!744 = !DILocalVariable(name: "Input", arg: 1, scope: !743, file: !85, line: 294, type: !70)
!745 = !DILocation(line: 294, scope: !743)
!746 = !DILocalVariable(name: "Size", arg: 2, scope: !743, file: !85, line: 295, type: !240)
!747 = !DILocation(line: 295, scope: !743)
!748 = !DILocalVariable(name: "HeapManagerProtocol", arg: 3, scope: !743, file: !85, line: 296, type: !556)
!749 = !DILocation(line: 296, scope: !743)
!750 = !DILocalVariable(name: "cd", scope: !743, file: !85, line: 298, type: !321)
!751 = !DILocation(line: 298, scope: !743)
!752 = !DILocalVariable(name: "Status", scope: !743, file: !85, line: 299, type: !224)
!753 = !DILocation(line: 299, scope: !743)
!754 = !DILocation(line: 300, scope: !743)
!755 = !DILocation(line: 302, scope: !756)
!756 = distinct !DILexicalBlock(scope: !757, file: !85, line: 301)
!757 = distinct !DILexicalBlock(scope: !743, file: !85, line: 300)
!758 = !DILocation(line: 302, scope: !759)
!759 = distinct !DILexicalBlock(scope: !756, file: !85, line: 302)
!760 = !DILocation(line: 302, scope: !761)
!761 = distinct !DILexicalBlock(scope: !762, file: !85, line: 302)
!762 = distinct !DILexicalBlock(scope: !759, file: !85, line: 302)
!763 = !DILocation(line: 302, scope: !764)
!764 = distinct !DILexicalBlock(scope: !761, file: !85, line: 302)
!765 = !DILocation(line: 302, scope: !766)
!766 = distinct !DILexicalBlock(scope: !767, file: !85, line: 302)
!767 = distinct !DILexicalBlock(scope: !764, file: !85, line: 302)
!768 = !DILocation(line: 303, scope: !756)
!769 = !DILocalVariable(name: "Output", scope: !743, file: !85, line: 305, type: !568)
!770 = !DILocation(line: 305, scope: !743)
!771 = !DILocation(line: 307, scope: !743)
!772 = !DILocation(line: 308, scope: !773)
!773 = distinct !DILexicalBlock(scope: !774, file: !85, line: 307)
!774 = distinct !DILexicalBlock(scope: !743, file: !85, line: 307)
!775 = !DILocation(line: 309, scope: !773)
!776 = !DILocation(line: 310, scope: !774)
!777 = !DILocation(line: 311, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !85, line: 310)
!779 = distinct !DILexicalBlock(scope: !774, file: !85, line: 310)
!780 = !DILocation(line: 312, scope: !778)
!781 = !DILocation(line: 313, scope: !779)
!782 = !DILocation(line: 314, scope: !783)
!783 = distinct !DILexicalBlock(scope: !784, file: !85, line: 313)
!784 = distinct !DILexicalBlock(scope: !779, file: !85, line: 313)
!785 = !DILocation(line: 315, scope: !783)
!786 = !DILocation(line: 317, scope: !787)
!787 = distinct !DILexicalBlock(scope: !784, file: !85, line: 316)
!788 = !DILocation(line: 317, scope: !789)
!789 = distinct !DILexicalBlock(scope: !787, file: !85, line: 317)
!790 = !DILocation(line: 317, scope: !791)
!791 = distinct !DILexicalBlock(scope: !792, file: !85, line: 317)
!792 = distinct !DILexicalBlock(scope: !789, file: !85, line: 317)
!793 = !DILocation(line: 317, scope: !794)
!794 = distinct !DILexicalBlock(scope: !791, file: !85, line: 317)
!795 = !DILocation(line: 317, scope: !796)
!796 = distinct !DILexicalBlock(scope: !797, file: !85, line: 317)
!797 = distinct !DILexicalBlock(scope: !794, file: !85, line: 317)
!798 = !DILocation(line: 318, scope: !787)
!799 = !DILocation(line: 313, scope: !784)
!800 = !DILocation(line: 310, scope: !779)
!801 = !DILocation(line: 320, scope: !743)
!802 = !DILocation(line: 321, scope: !803)
!803 = distinct !DILexicalBlock(scope: !743, file: !85, line: 320)
!804 = !DILocalVariable(name: "OutputSize", scope: !743, file: !85, line: 322, type: !65)
!805 = !DILocation(line: 322, scope: !743)
!806 = !DILocalVariable(name: "InputPtr", scope: !743, file: !85, line: 323, type: !70)
!807 = !DILocation(line: 323, scope: !743)
!808 = !DILocalVariable(name: "OutputPtr", scope: !743, file: !85, line: 324, type: !70)
!809 = !DILocation(line: 324, scope: !743)
!810 = !DILocation(line: 325, scope: !743)
!811 = !DILocation(line: 326, scope: !743)
!812 = !DILocation(line: 327, scope: !743)
!813 = !DILocation(line: 328, scope: !743)
!814 = !DILocation(line: 329, scope: !815)
!815 = distinct !DILexicalBlock(scope: !743, file: !85, line: 328)
!816 = !DILocation(line: 331, scope: !743)
!817 = !DILocation(line: 332, scope: !743)
!818 = distinct !DISubprogram(name: "CharConverterEntryPoint", scope: !85, file: !85, line: 336, type: !819, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !328)
!819 = !DISubroutineType(types: !820)
!820 = !{!224, !821, !822}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !192, line: 33, baseType: !53)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !14, line: 2053, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_TABLE", file: !14, line: 1992, size: 960, elements: !825)
!825 = !{!826, !835, !836, !837, !838, !862, !863, !918, !919, !920, !1054, !1312, !1313}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !824, file: !14, line: 1996, baseType: !827, size: 192)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !6, line: 177, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TABLE_HEADER", file: !6, line: 150, size: 192, elements: !829)
!829 = !{!830, !831, !832, !833, !834}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !828, file: !6, line: 156, baseType: !58, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !828, file: !6, line: 163, baseType: !90, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !828, file: !6, line: 167, baseType: !90, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !828, file: !6, line: 172, baseType: !90, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !828, file: !6, line: 176, baseType: !90, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !824, file: !14, line: 2001, baseType: !62, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !824, file: !14, line: 2006, baseType: !90, size: 32, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !824, file: !14, line: 2011, baseType: !821, size: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !824, file: !14, line: 2016, baseType: !839, size: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !841, line: 20, baseType: !842)
!841 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextIn.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !841, line: 116, size: 192, elements: !843)
!843 = !{!844, !849, !860}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !842, file: !841, line: 117, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !841, line: 86, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!224, !839, !68}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !842, file: !841, line: 118, baseType: !850, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !841, line: 107, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!224, !839, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !841, line: 38, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_INPUT_KEY", file: !841, line: 35, size: 32, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !856, file: !841, line: 36, baseType: !198, size: 16)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !856, file: !841, line: 37, baseType: !60, size: 16, offset: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !842, file: !841, line: 122, baseType: !861, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !192, line: 37, baseType: !53)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !824, file: !14, line: 2020, baseType: !821, size: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !824, file: !14, line: 2025, baseType: !864, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !866, line: 27, baseType: !867)
!866 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextOut.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !866, line: 387, size: 640, elements: !868)
!868 = !{!869, !874, !879, !881, !887, !892, !894, !899, !904, !906}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !867, file: !866, line: 388, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !866, line: 167, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!224, !864, !68}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !867, file: !866, line: 390, baseType: !875, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !866, line: 192, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!224, !864, !62}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !867, file: !866, line: 391, baseType: !880, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !866, line: 213, baseType: !876)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !867, file: !866, line: 393, baseType: !882, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !866, line: 236, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!224, !864, !56, !886, !886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !867, file: !866, line: 394, baseType: !888, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !866, line: 256, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!224, !864, !56}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !867, file: !866, line: 395, baseType: !893, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !866, line: 277, baseType: !889)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !867, file: !866, line: 397, baseType: !895, size: 64, offset: 384)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !866, line: 295, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!224, !864}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !867, file: !866, line: 398, baseType: !900, size: 64, offset: 448)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !866, line: 318, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!224, !864, !56, !56}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !867, file: !866, line: 399, baseType: !905, size: 64, offset: 512)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !866, line: 340, baseType: !871)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !867, file: !866, line: 404, baseType: !907, size: 64, offset: 576)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !866, line: 379, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !866, line: 349, size: 192, elements: !910)
!910 = !{!911, !913, !914, !915, !916, !917}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !909, file: !866, line: 353, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !57, line: 174, baseType: !76)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !909, file: !866, line: 362, baseType: !912, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !909, file: !866, line: 366, baseType: !912, size: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !909, file: !866, line: 370, baseType: !912, size: 32, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !909, file: !866, line: 374, baseType: !912, size: 32, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !909, file: !866, line: 378, baseType: !68, size: 8, offset: 160)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !824, file: !14, line: 2030, baseType: !821, size: 64, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !824, file: !14, line: 2035, baseType: !864, size: 64, offset: 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !824, file: !14, line: 2039, baseType: !921, size: 64, offset: 704)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1871, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1828, size: 1088, elements: !924)
!924 = !{!925, !926, !955, !960, !966, !971, !987, !992, !1007, !1012, !1017, !1022, !1028, !1042, !1049}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !923, file: !14, line: 1832, baseType: !827, size: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !923, file: !14, line: 1837, baseType: !927, size: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !14, line: 816, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!224, !931, !948}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !192, line: 80, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !192, line: 68, size: 128, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !946, !947}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !933, file: !192, line: 69, baseType: !198, size: 16)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !933, file: !192, line: 70, baseType: !109, size: 8, offset: 16)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !933, file: !192, line: 71, baseType: !109, size: 8, offset: 24)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !933, file: !192, line: 72, baseType: !109, size: 8, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !933, file: !192, line: 73, baseType: !109, size: 8, offset: 40)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !933, file: !192, line: 74, baseType: !109, size: 8, offset: 48)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !933, file: !192, line: 75, baseType: !109, size: 8, offset: 56)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !933, file: !192, line: 76, baseType: !90, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !933, file: !192, line: 77, baseType: !944, size: 16, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !57, line: 187, baseType: !945)
!945 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !933, file: !192, line: 78, baseType: !109, size: 8, offset: 112)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !933, file: !192, line: 79, baseType: !109, size: 8, offset: 120)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !14, line: 799, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME_CAPABILITIES", file: !14, line: 776, size: 96, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !950, file: !14, line: 783, baseType: !90, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !950, file: !14, line: 790, baseType: !90, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !950, file: !14, line: 798, baseType: !68, size: 8, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !923, file: !14, line: 1838, baseType: !956, size: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !14, line: 833, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!224, !931}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !923, file: !14, line: 1839, baseType: !961, size: 64, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !14, line: 854, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!224, !965, !965, !931}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !923, file: !14, line: 1840, baseType: !967, size: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !14, line: 876, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!224, !68, !931}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !923, file: !14, line: 1845, baseType: !972, size: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !14, line: 327, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!224, !56, !56, !90, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 175, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 143, size: 320, elements: !979)
!979 = !{!980, !981, !983, !985, !986}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !978, file: !14, line: 149, baseType: !90, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !978, file: !14, line: 155, baseType: !982, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !192, line: 50, baseType: !58)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !978, file: !14, line: 161, baseType: !984, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !192, line: 55, baseType: !58)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !978, file: !14, line: 168, baseType: !58, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !978, file: !14, line: 174, baseType: !58, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !923, file: !14, line: 1846, baseType: !988, size: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !14, line: 422, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!224, !56, !71}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !923, file: !14, line: 1851, baseType: !993, size: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !14, line: 686, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!224, !62, !997, !1006, !886, !53}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !192, line: 25, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !55, line: 218, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !55, line: 213, size: 128, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !1000, file: !55, line: 214, baseType: !90, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !1000, file: !55, line: 215, baseType: !198, size: 16, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !1000, file: !55, line: 216, baseType: !198, size: 16, offset: 48)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !1000, file: !55, line: 217, baseType: !201, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !923, file: !14, line: 1852, baseType: !1008, size: 64, offset: 640)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !14, line: 722, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!224, !886, !62, !997}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !923, file: !14, line: 1853, baseType: !1013, size: 64, offset: 704)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !14, line: 764, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!224, !62, !997, !90, !56, !53}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !923, file: !14, line: 1858, baseType: !1018, size: 64, offset: 768)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !14, line: 1097, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!224, !1006}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !923, file: !14, line: 1859, baseType: !1023, size: 64, offset: 832)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !14, line: 1062, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !1027, !224, !56, !53}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !6, line: 145, baseType: !5)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !923, file: !14, line: 1864, baseType: !1029, size: 64, offset: 896)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !14, line: 1723, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!224, !1033, !56, !982}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !14, line: 1669, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CAPSULE_HEADER", file: !14, line: 1648, size: 224, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !1036, file: !14, line: 1652, baseType: !998, size: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !1036, file: !14, line: 1658, baseType: !90, size: 32, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !1036, file: !14, line: 1664, baseType: !90, size: 32, offset: 160)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !1036, file: !14, line: 1668, baseType: !90, size: 32, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !923, file: !14, line: 1865, baseType: !1043, size: 64, offset: 960)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !14, line: 1754, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!224, !1033, !56, !1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !923, file: !14, line: 1870, baseType: !1050, size: 64, offset: 1024)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !14, line: 1785, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!224, !90, !1047, !1047, !1047}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !824, file: !14, line: 2043, baseType: !1055, size: 64, offset: 768)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !14, line: 1972, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_BOOT_SERVICES", file: !14, line: 1879, size: 3008, elements: !1058)
!1058 = !{!1059, !1060, !1066, !1071, !1079, !1084, !1089, !1094, !1099, !1109, !1115, !1120, !1125, !1127, !1129, !1136, !1141, !1146, !1151, !1152, !1157, !1163, !1180, !1185, !1190, !1196, !1201, !1206, !1211, !1216, !1221, !1226, !1231, !1236, !1241, !1246, !1260, !1267, !1273, !1278, !1283, !1288, !1293, !1298, !1303}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !1057, file: !14, line: 1883, baseType: !827, size: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !1057, file: !14, line: 1888, baseType: !1061, size: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !14, line: 644, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!1065, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !192, line: 41, baseType: !56)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !1057, file: !14, line: 1889, baseType: !1067, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !14, line: 656, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !1065}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !1057, file: !14, line: 1894, baseType: !1072, size: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !14, line: 203, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!224, !1076, !1077, !56, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !14, line: 47, baseType: !13)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !6, line: 112, baseType: !20)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !1057, file: !14, line: 1895, baseType: !1080, size: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !14, line: 224, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!224, !982, !56}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !1057, file: !14, line: 1896, baseType: !1085, size: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !14, line: 256, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!224, !886, !976, !886, !886, !1006}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !1057, file: !14, line: 1897, baseType: !1090, size: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !14, line: 285, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!224, !1077, !56, !71}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !1057, file: !14, line: 1898, baseType: !1095, size: 64, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !14, line: 302, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!224, !53}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !1057, file: !14, line: 1903, baseType: !1100, size: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !14, line: 480, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!224, !90, !1065, !1104, !53, !1108}
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !14, line: 457, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{null, !861, !53}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !1057, file: !14, line: 1904, baseType: !1110, size: 64, offset: 704)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !14, line: 554, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!224, !861, !1114, !58}
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !14, line: 534, baseType: !39)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !1057, file: !14, line: 1905, baseType: !1116, size: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !14, line: 590, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!224, !56, !1108, !886}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !1057, file: !14, line: 1906, baseType: !1121, size: 64, offset: 832)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !14, line: 570, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!224, !861}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !1057, file: !14, line: 1907, baseType: !1126, size: 64, offset: 896)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !14, line: 606, baseType: !1122)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !1057, file: !14, line: 1908, baseType: !1128, size: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !14, line: 622, baseType: !1122)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !1057, file: !14, line: 1913, baseType: !1130, size: 64, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !14, line: 1188, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!224, !1134, !997, !1135, !53}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !14, line: 1164, baseType: !44)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !1057, file: !14, line: 1914, baseType: !1137, size: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1238, baseType: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!224, !821, !997, !53, !53}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !1057, file: !14, line: 1915, baseType: !1142, size: 64, offset: 1152)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1264, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!224, !821, !997, !53}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !1057, file: !14, line: 1916, baseType: !1147, size: 64, offset: 1216)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !14, line: 1305, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!224, !821, !997, !71}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !1057, file: !14, line: 1917, baseType: !53, size: 64, offset: 1280)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !1057, file: !14, line: 1918, baseType: !1153, size: 64, offset: 1344)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !14, line: 1466, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!224, !997, !861, !71}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !1057, file: !14, line: 1919, baseType: !1158, size: 64, offset: 1408)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !14, line: 1515, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!224, !1162, !997, !53, !886, !1134}
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !14, line: 1489, baseType: !47)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !1057, file: !14, line: 1920, baseType: !1164, size: 64, offset: 1472)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !14, line: 1541, baseType: !1165)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!224, !997, !1168, !1134}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !1171, line: 58, baseType: !1172)
!1171 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_testcases/emergency-testcases/edk2-testcases", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !1171, line: 43, size: 32, elements: !1173)
!1173 = !{!1174, !1175, !1176}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !1172, file: !1171, line: 44, baseType: !109, size: 8)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !1172, file: !1171, line: 51, baseType: !109, size: 8, offset: 8)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !1172, file: !1171, line: 56, baseType: !1177, size: 16, offset: 16)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 16, elements: !1178)
!1178 = !{!1179}
!1179 = !DISubrange(count: 2)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !1057, file: !14, line: 1921, baseType: !1181, size: 64, offset: 1536)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !14, line: 1562, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!224, !997, !53}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !1057, file: !14, line: 1926, baseType: !1186, size: 64, offset: 1600)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !14, line: 913, baseType: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!224, !68, !821, !1169, !53, !56, !1134}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !1057, file: !14, line: 1927, baseType: !1191, size: 64, offset: 1664)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !14, line: 938, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!224, !821, !886, !1195}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !1057, file: !14, line: 1928, baseType: !1197, size: 64, offset: 1728)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !14, line: 966, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!224, !821, !224, !56, !62}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !1057, file: !14, line: 1929, baseType: !1202, size: 64, offset: 1792)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !14, line: 984, baseType: !1203)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!224, !821}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !1057, file: !14, line: 1930, baseType: !1207, size: 64, offset: 1856)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !14, line: 1000, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!224, !821, !56}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !1057, file: !14, line: 1935, baseType: !1212, size: 64, offset: 1920)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !14, line: 1081, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!224, !1047}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !1057, file: !14, line: 1936, baseType: !1217, size: 64, offset: 1984)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !14, line: 1016, baseType: !1218)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!224, !56}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !1057, file: !14, line: 1937, baseType: !1222, size: 64, offset: 2048)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !14, line: 1038, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!224, !56, !58, !56, !62}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !1057, file: !14, line: 1942, baseType: !1227, size: 64, offset: 2112)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !14, line: 361, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!224, !821, !1134, !1169, !68}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !1057, file: !14, line: 1943, baseType: !1232, size: 64, offset: 2176)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !14, line: 394, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!224, !821, !821, !821}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !1057, file: !14, line: 1948, baseType: !1237, size: 64, offset: 2240)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !14, line: 1347, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!224, !821, !997, !71, !821, !821, !90}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !1057, file: !14, line: 1949, baseType: !1242, size: 64, offset: 2304)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !14, line: 1379, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!224, !821, !997, !821, !821}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !1057, file: !14, line: 1950, baseType: !1247, size: 64, offset: 2368)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !14, line: 1413, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!224, !821, !997, !1251, !886}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1394, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1389, size: 192, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "AgentHandle", scope: !1254, file: !14, line: 1390, baseType: !821, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "ControllerHandle", scope: !1254, file: !14, line: 1391, baseType: !821, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !1254, file: !14, line: 1392, baseType: !90, size: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCount", scope: !1254, file: !14, line: 1393, baseType: !90, size: 32, offset: 160)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolsPerHandle", scope: !1057, file: !14, line: 1955, baseType: !1261, size: 64, offset: 2432)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROTOCOLS_PER_HANDLE", file: !14, line: 1443, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!224, !821, !1265, !886}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandleBuffer", scope: !1057, file: !14, line: 1956, baseType: !1268, size: 64, offset: 2496)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE_BUFFER", file: !14, line: 1588, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!224, !1162, !997, !53, !886, !1272}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "LocateProtocol", scope: !1057, file: !14, line: 1957, baseType: !1274, size: 64, offset: 2560)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !14, line: 1615, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!224, !997, !53, !71}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "InstallMultipleProtocolInterfaces", scope: !1057, file: !14, line: 1958, baseType: !1279, size: 64, offset: 2624)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1213, baseType: !1280)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!224, !1134, null}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallMultipleProtocolInterfaces", scope: !1057, file: !14, line: 1959, baseType: !1284, size: 64, offset: 2688)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1283, baseType: !1285)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!224, !821, null}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "CalculateCrc32", scope: !1057, file: !14, line: 1964, baseType: !1289, size: 64, offset: 2752)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CALCULATE_CRC32", file: !14, line: 1118, baseType: !1290)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!224, !53, !56, !1006}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "CopyMem", scope: !1057, file: !14, line: 1969, baseType: !1294, size: 64, offset: 2816)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_COPY_MEM", file: !14, line: 1134, baseType: !1295)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{null, !53, !53, !56}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "SetMem", scope: !1057, file: !14, line: 1970, baseType: !1299, size: 64, offset: 2880)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_MEM", file: !14, line: 1150, baseType: !1300)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{null, !53, !56, !109}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEventEx", scope: !1057, file: !14, line: 1971, baseType: !1304, size: 64, offset: 2944)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT_EX", file: !14, line: 509, baseType: !1305)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!224, !90, !1065, !1104, !1308, !1310, !1108}
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !824, file: !14, line: 2047, baseType: !56, size: 64, offset: 832)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigurationTable", scope: !824, file: !14, line: 2052, baseType: !1314, size: 64, offset: 896)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 1987, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 1978, size: 192, elements: !1317)
!1317 = !{!1318, !1319}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !1316, file: !14, line: 1982, baseType: !998, size: 128)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !1316, file: !14, line: 1986, baseType: !53, size: 64, offset: 128)
